---
kind: property
id: P:Autodesk.Revit.DB.Construction.Id
source: html/dde24473-9db0-a83a-cf21-21c149544780.htm
---
# Autodesk.Revit.DB.Construction.Id Property

Get the id of the Construction.

## Syntax (C#)
```csharp
public string Id { get; }
```

## Remarks
This property is used to get the id of the Construction.